In [1]:
import pandas as pd
from utils import connection as con

creamos un metodo de extraccion de tabla en el modulo etl y lo importamos

In [2]:
conn_retail_db = con.connect_retail_db()
conn_dw_retail = con.connect_dw_retail()

In [3]:
from etl import extract as ex

importamos las tablas en orden

In [4]:
customers = ex.extract_table(conn_retail_db, 'customers')
orders = ex.extract_table(conn_retail_db, 'orders')
order_items = ex.extract_table(conn_retail_db, 'order_items')
products = ex.extract_table(conn_retail_db, 'products')
categories = ex.extract_table(conn_retail_db, 'categories')
departments = ex.extract_table(conn_retail_db, 'departments')

In [5]:
customers.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,00725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,00725

Cargamos los datos en el orden en que las relaciones de la OLAP dw_retail lo determinan

In [6]:
from etl import load

In [14]:
# customers
load.load_to_dw_retail(conn_dw_retail, 'dimension_customer', customers.drop('customer_password', axis=1))

(MySQLdb.IntegrityError) (1062, "Duplicate entry '1' for key 'dimension_customer.PRIMARY'")
[SQL: INSERT INTO dimension_customer (customer_id, customer_fname, customer_lname, customer_email, customer_street, customer_city, customer_state, customer_zipcode) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)]
[parameters: [(1, 'Richard', 'Hernandez', 'XXXXXXXXX', '6303 Heather Plaza', 'Brownsville', 'TX', '78521'), (2, 'Mary', 'Barrett', 'XXXXXXXXX', '9526 Noble Embers Ridge', 'Littleton', 'CO', '80126'), (3, 'Ann', 'Smith', 'XXXXXXXXX', '3422 Blue Pioneer Bend', 'Caguas', 'PR', '00725'), (4, 'Mary', 'Jones', 'XXXXXXXXX', '8324 Little Common', 'San Marcos', 'CA', '92069'), (5, 'Robert', 'Hudson', 'XXXXXXXXX', '10 Crystal River Mall ', 'Caguas', 'PR', '00725'), (6, 'Mary', 'Smith', 'XXXXXXXXX', '3151 Sleepy Quail Promenade', 'Passaic', 'NJ', '07055'), (7, 'Melissa', 'Wilcox', 'XXXXXXXXX', '9453 High Concession', 'Caguas', 'PR', '00725'), (8, 'Megan', 'Smith', 'XXXXXXXXX', '3047 Foggy Forest Plaza', 'Lawrence', 'MA', '01841')  ... displaying 10 of 12435 total bound parameter sets ...  (12434, 'Mary', 'Mills', 'XXXXXXXXX', '9720 Colonial Parade', 'Caguas', 'PR', '00725'), (12435, 'Laura', 'Horton', 'XXXXXXXXX', '5736 Honey Downs', 'Summerville', 'SC', '29483')]]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [13]:
dw_customer = pd.read_sql('SELECT * FROM dimension_customer', con=conn_dw_retail)
dw_customer.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,00725
3,4,Mary,Jones,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,00725

In [15]:
# departments
load.load_to_dw_retail(conn_dw_retail, 'dimension_department', departments)

In [16]:
# categories
load.load_to_dw_retail(conn_dw_retail, 'dimension_category', categories)

In [17]:
# products
load.load_to_dw_retail(conn_dw_retail, 'dimension_product', products)

In [18]:
# orders
load.load_to_dw_retail(conn_dw_retail, 'dimension_order', orders)

In [19]:
# order_items
load.load_to_dw_retail(conn_dw_retail, 'dimension_order_item', order_items)

Importamos la dimension de tiempo que resulta de transformar el campo time de orders

In [26]:
from etl import transform as t

In [ ]:
query = """
    
"""